{
	"title": "High Altitude Balloon",
	"post-img": {
		"alt": "High Altitude Balloon (HAB)",
		"url": "img/projects/balloon/balloon.png"
	},
	"date": "23 Sept",
	"blog-title": "High Altitude Balloon",
	"blog-info": {
		"Project Led by": {
			"list": ["Abhishyant Khare"],
			"icon": "user"
		},
		"Tagged as": {
			"list": ["Engineering"],
			"icon": "bookmark"
		}
	},
	"blog-content": [
			{
				"class": "lead",
				"content": "A high altitude balloon is an unmanned balloon, typically a weather balloon, that is launched into near space usually with some kind of scientific payload or camera."
			},
			"Balloons reach about 20-30 kilometers in altitude and stay aloft for 2-3 hours. High altitude balloons have recently been a focus in the scientific community as a low cost method of launching equipment into near space. ",
			"We have started developing a low cost High Altitude Balloon (HAB) program that enables a standardized system to test research experiments in a near-space environment. While there are a variety of space applications for high altitude balloons, the current project will focus on the long term goal of creating a reliable high altitude balloon for future STAC experiments. This way, observations can be made above the Earth’s atmosphere for a low cost.",
			"We will launch three high-altitude balloons by May 2018. The first balloon will be equipped with a camera and electronic sensors to test the efficacy of our system and then two subsequent balloons will be launched with various research experiments, crowdsourced from the Berkeley campus community. This will form the foundation of a long lasting STAC HAB program with launches for years to come. HAB payloads (aerospace cargo) will help detail how a near space environment affects lifeforms, optics, and physical mechanics. Once the ability to do this is successfully is ensured, then we plan to launch a telescope payload to show that it is possible to put telescopes above Earth’s atmosphere for a low cost method of performing cosmology. "
		]
}