{
	"title": "The Smart Biosphere",
	"background": "img/background/space11.jpg",
	"post-img": {
		"alt": "BioSphere",
		"url": "img/projects/biosphere/biosphere1.png"
	},
	"date": "21 Oct",
	"blog-title": "Smart Extraterrestrial Environment Design",
	"blog-info": {
		"Project Led by": {
			"list": ["William Sharpless"],
			"icon": "user"
		},
		"Tagged as": {
			"list": ["Engineering"],
			"icon": "bookmark"
		}
	},
	"blog-content": [
    "Earth is the ultimate autonomous and self-repairing biome ideally suited for life, and while it is not possible to recreate it in its entirety with current technology, we are working to take the first steps to bring the future into the present.",
    {
      "class": "lead",
      "content": "<b>The Biosphere Project aims to create a habitat with an earth-like environment sustained by a biologic engine and harvestable resources.  The environment would implement 'smart' controls and operation software to maintain the biome's equilibrium and continuous function.</b>"
    },
    "<div class='row'><div class='col-sm-8 col-sm-offset-2 text-center'><iframe src='https://docs.google.com/presentation/d/e/2PACX-1vT2PfQ-0ewrxHQaDqDSJScajWXdn9b2hYhzKSbMb6Xjj9AZkbRF3P-d_Z4XTzX42fxIfM4-snIZfQ0v/embed?start=false&loop=false&delayms=30000' frameborder='0' width='837' height='400' allowfullscreen='true' mozallowfullscreen='true' webkitallowfullscreen='true'></iframe></div></div>",
    "A manufactured replication of a sustainable, terra-like ecosystem would provide humanity with a means to survive extraterrestrial establishments providing for shelter, production of goods and energy-efficient regenerative systems. Agriculture can be processed for food, biofuels, chemical production etc. and our project serves as a direct way to supply astronauts and space colonies with those necessities while minimizing commercial orbital transport load.",
    {
      "type": "image",
      "url": "img/projects/biosphere/biosphere2.png"
    },
    "The STAC Biosphere Project will open a new dimension of production in space beyond the mechanical and electrical systems of NASA's current capabilities and will serve as a home which models our own. Therefore the Biosphere is the gateway to the sustained inhabitants and eventual colonization of space.",
    "The first prototype of our project will contain vegetation and a support system with preparation to simulate conditions for deployment on Mars. Our autonomous software will take continuous feedback data from a myriad of sensors and with an IOT network of mechanical controls alter the light, aeroponic irrigation, temperature, ventilation, humidity and gas concentrations to maintain stability. For example, through control of plant growth, one can control the composition of gases in the closed system and with harvested solar power, the system can supply light to the plants to drive photosynthesis and thereby decrease the quantity of carbon dioxide and increase oxygen or alternatively, plant lighting can be reduced to allow botanical respiration run in reverse.",
    "The projected has manifested as a cubic, two-foot steel box that is pressurized to one atmosphere and will be structurally sound to survive a pressure differential to 0.006 atmospheres, the atmospheric pressure of Mars. The box has thermal support to protect against the sub -100 C Martian nights and runs off solar power, but contains internal UV lighting to avoid dependence on inconsistent natural light and control of plant growth. Our control system runs off a Texas Instrument Launchpad and the code is in arduino and Rasberry Pi. The plants are growing with an aeroponic irrigation system as this has shown to be one of the most efficient methods of agriculture.",
    {
      "type": "image",
      "url": "img/projects/biosphere/biosphere3.png"
    },
    "This first effort intends to develop a working prototype on which further capabilities can be added.  Once we have designed the control scheme to handle system administration, we plan to expand to a larger enclosure and test other ecological and microbiological methods to maintaining and cycling a habitat including waste regeneration and in-situ resource utilization of regolith. In this way, it is our intention to produce a working controller for environmental monitoring and dynamic equilibrium to allow for colonization of extra-terrestrial systems."
  ]
}