{
  "title": "TIME II",
  "background": "img/background/space11.jpg",
  "post-img": {
    "alt": "The Interstellar Microgravity Experiments II",
    "url": "img/projects/time2/microG.jpg"
  },
  "date": "21 Oct",
  "blog-title": "The Interstellar Microgravity Experiments (TIME) II",
  "blog-info": {
    "Project Led by": {
      "list": ["Daniel Sotsaikich"],
      "icon": "user"
    },
    "Tagged as": {
      "list": ["Engineering"],
      "icon": "bookmark"
    }
  },
  "blog-content": [
    {
      "class": "lead",
      "content": "<b> We have been working on the next set of microgravity experiments, after our initial set of <a href='/projects/time1'>microgravity experiments</a>. We plan to reuse our chassis (or enclosure) and communication systems design from the TIME project for future payload launches to space.</b>"
    },
    "Reusability of our current design allows us to focus our efforts on the ideation, design, and actual implementation of a new set of experiments for the future payload. Our enclosure has a modular shelving design, which enables easy integration with new experiments while meeting safety and design requirements.",
    "We hope to use the second set of microgravity experiments to cement TIME as an annual project within STAC. With a solid chassis and communication systems already designed, TIME will be a great platform for us to explore new and scientifically-significant research ideas every year. It will allow future members the ability to research their own specific interests from the vast array of topics that are affected by microgravity, and keep the future of STAC on the path towards pushing the frontiers of space research.",
    "TIME-2, the official second set of microgravity experiments within STAC, is still in the idea-generation and brainstorming phase. We are currently pursuing a solid direction into an array of biology experiments, with focuses on bacteria, stem cell, and CRISPR. We have been reading a ton of literature and talking to multiple professors and graduate students on campus, and hope to push out a defined set of experiments within the next few weeks."
  ]
}